# Nicholas Early
## Week 13
### Python Dataframe Processing

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#Drop entries
df = DataFrame(np.arange(16).reshape((4,4)),
              index = ['Ohio','Colorado','Utah','New York'],
              columns = ['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df.drop(['Colorado','Utah'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [5]:
df.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [6]:
df.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [7]:
#select entries
df = DataFrame(np.arange(16).reshape((4,4)),
              index = ['Ohio','Colorado','Utah','New York'],
              columns = ['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [9]:
df[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [10]:
df[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [11]:
df[df['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
df > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [13]:
#select entries with loc and iloc
df.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [14]:
df.loc['Colorado',['two','four']]

two     5
four    7
Name: Colorado, dtype: int32

In [15]:
df.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [16]:
df.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [17]:
df.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [18]:
#Arithmatic and alignment of data
df1 = DataFrame(np.arange(9).reshape((3,3)), columns = list('bcd'), index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12).reshape((4,3)), columns = list('bde'), index=['Utah','Ohio','Texas','Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [19]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [20]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [21]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [22]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [23]:
df1['e']=df1['b']+df1['d']

In [24]:
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [25]:
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [26]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [27]:
#sort and rank
df3 = DataFrame(np.arange(8).reshape((2,4)),columns=list('dabc'),index=['three','one'])
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [28]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [29]:
df3.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [30]:
df3.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [31]:
df4 = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [32]:
df4.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [33]:
df4.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [34]:
df5 = DataFrame({'b':[14,17,-13,12], 'a':[10,11,10,11]})
df5

    b   a
0  14  10
1  17  11
2 -13  10
3  12  11

In [35]:
df5.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [44]:
#summarizing data
df = DataFrame([1.4,np.nan], [7.1,-4.5], [0,0], [0.75,-1.3], 
               index=['three','one'], 
               columns=['one','two'])

TypeError: __init__() got multiple values for argument 'index'

In [45]:
df5.mean

<bound method DataFrame.mean of     b   a
0  14  10
1  17  11
2 -13  10
3  12  11>

In [47]:
df5.mean(axis=1)

0    12.0
1    14.0
2    -1.5
3    11.5
dtype: float64

In [48]:
df5.min()

b   -13
a    10
dtype: int64

In [49]:
df5.describe()

               b         a
count   4.000000   4.00000
mean    7.500000  10.50000
std    13.820275   0.57735
min   -13.000000  10.00000
25%     5.750000  10.00000
50%    13.000000  10.50000
75%    14.750000  11.00000
max    17.000000  11.00000

In [51]:
df = DataFrame([[1,2,3,4],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [52]:
clean_df = df.dropna()
clean_df

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [53]:
df.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [54]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [55]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [56]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [58]:
df.fillna(0,inplace=True)
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [60]:
#value counts
df = DataFrame({'Qu1':[1,3,4,3,4],
               'Qu2':[12,3,1,2,3],
               'Qu3':[1,5,2,4,4]},
              index=['a','b','c','d','e'])
df

   Qu1  Qu2  Qu3
a    1   12    1
b    3    3    5
c    4    1    2
d    3    2    4
e    4    3    4

In [62]:
df['Qu1'].value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [63]:
rs = df.apply(pd.value_counts)

rs

    Qu1  Qu2  Qu3
1   1.0  1.0  1.0
2   NaN  1.0  1.0
3   2.0  2.0  NaN
4   2.0  NaN  2.0
5   NaN  NaN  1.0
12  NaN  1.0  NaN

In [65]:
rs.index.name='values'
rs

        Qu1  Qu2  Qu3
values
1       1.0  1.0  1.0
2       NaN  1.0  1.0
3       2.0  2.0  NaN
4       2.0  NaN  2.0
5       NaN  NaN  1.0
12      NaN  1.0  NaN